# Задание 5. Вызов генератора файлов
# Доработайте предыдущую задачу.
# Создайте новую функцию, которая генерирует файлы с разными расширениями
# Расширения и количество файлов функция принимает в качестве параметров
# Количество переданных расширений может быть любое
# Количество файлов для каждого расширения различно
# Внутри используйте вызов функции из предыдущей задачи

__all__ = ['generate_file']

from task4 import *

def generate_file(**kwargs):
    for key, item in kwargs.items():
        create_file(f'.{key}',count = item)

if __name__ == '__main__':
    generate_file(txt=2, jpg=1)